Table of Contents
 Class PlateData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides data of the single plate
[DataContract]
public class PlateData : OpenElementId
Inheritance
object
OpenObject
OpenElementId
PlateData
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AxisX
LCS - Axis X
[DataMember]
public Vector3D AxisX { get; set; }
Property Value
Vector3D
 AxisY
LCS - Axis Y
[DataMember]
public Vector3D AxisY { get; set; }
Property Value
Vector3D
 AxisZ
LCS - Axis Z
[DataMember]
public Vector3D AxisZ { get; set; }
Property Value
Vector3D
 Geometry
Geometry of the plate described by Region2D - new prefered representation of geometry
[DataMember]
public Region2D Geometry { get; set; }
Property Value
Region2D
 IsNegativeObject
Is negative object
[DataMember]
public bool IsNegativeObject { get; set; }
Property Value
bool
 Material
Name of the material
[DataMember]
public string Material { get; set; }
Property Value
string
 Name
Name of the plate
[DataMember]
public string Name { get; set; }
Property Value
string
 Origin
Origin of the plate LCS
[DataMember]
public Point3D Origin { get; set; }
Property Value
Point3D
 OriginalModelId
Get or set the identification in the original model In the case of the imported connection from another application
[DataMember]
public string OriginalModelId { get; set; }
Property Value
string
 OutlinePoints
Outline points
[DataMember]
public List<Point2D> OutlinePoints { get; set; }
Property Value
List<Point2D>
 Region
Geometry of the plate in svg format. In next version will be mark as OBSOLETE! New use property Geometry
[DataMember]
public string Region { get; set; }
Property Value
string
 Thickness
Thickness of the plate
[DataMember]
public double Thickness { get; set; }
Property Value
double
 Edit this page